## To predict if a customer will repay the loan amount or not .

### Importing the required libraries

In [2]:
import pandas as pd
import numpy as np
from sklearn.model_selection import train_test_split
from sklearn.metrics import accuracy_score
from sklearn.tree import DecisionTreeClassifier
from sklearn import tree

### Uploading the dataset

In [3]:
df = pd.read_csv('D:\\Loan Repayment.csv')
df

       1      2    3     4    sum Unnamed: 5
0    201  10018  250  3046  13515        yes
1    205  10016  395  3044  13660        yes
2    257  10129  109  3251  13746        yes
3    246  10064  324  3137  13771        yes
4    117  10115  496  3094  13822        yes
..   ...    ...  ...   ...    ...        ...
995  413  14914  523  4683  20533         No
996  359  14423  927  4838  20547         No
997  316  14872  613  4760  20561         No
998  305  14926  897  4572  20700         No
999  168  14798  834  4937  20737         No

[1000 rows x 6 columns]

### Dataset Analysis

In [4]:
df = df.rename(columns={'1':'Initial Payment','2':'Last Payment','3':'Credit Score','4':'House Number','Unnamed: 5':'Result'})
df.head()

   Initial Payment  Last Payment  Credit Score  House Number    sum Result
0              201         10018           250          3046  13515    yes
1              205         10016           395          3044  13660    yes
2              257         10129           109          3251  13746    yes
3              246         10064           324          3137  13771    yes
4              117         10115           496          3094  13822    yes

In [5]:
df.drop(['sum'],axis=1,inplace=True)

In [6]:
df.head()

   Initial Payment  Last Payment  Credit Score  House Number Result
0              201         10018           250          3046    yes
1              205         10016           395          3044    yes
2              257         10129           109          3251    yes
3              246         10064           324          3137    yes
4              117         10115           496          3094    yes

In [7]:
df

     Initial Payment  Last Payment  Credit Score  House Number Result
0                201         10018           250          3046    yes
1                205         10016           395          3044    yes
2                257         10129           109          3251    yes
3                246         10064           324          3137    yes
4                117         10115           496          3094    yes
..               ...           ...           ...           ...    ...
995              413         14914           523          4683     No
996              359         14423           927          4838     No
997              316         14872           613          4760     No
998              305         14926           897          4572     No
999              168         14798           834          4937     No

[1000 rows x 5 columns]

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Initial Payment  1000 non-null   int64
 1   Last Payment     1000 non-null   int64
 2   Credit Score     1000 non-null   int64
 3   House Number     1000 non-null   int64
 4   Result           1000 non-null   object
dtypes: int64(4), object(1)
memory usage: 39.2+ KB

In [9]:
df.describe()

       Initial Payment  Last Payment  Credit Score  House Number
count       1000.00000    1000.00000   1000.000000   1000.000000
mean         294.34300   12465.88400    528.042000   4027.011000
std          115.81539    1440.15617    259.796059    565.164179
min          100.00000   10005.00000    100.000000   3003.000000
25%          195.00000   11201.50000    302.000000   3545.000000
50%          289.50000   12450.00000    516.500000   4041.500000
75%          398.00000   13678.25000    753.500000   4507.000000
max          500.00000   14996.00000    997.000000   5000.000000

In [10]:
df.shape

(1000, 5)

In [11]:
duplicated_rows = df[df.duplicated()]
print("The number of duplicated roes are :",duplicated_rows.shape)

The number of duplicated roes are : (0, 5)

In [12]:
df.isnull().sum()

Initial Payment    0
Last Payment       0
Credit Score       0
House Number       0
Result             0
dtype: int64

### Here we will be using decision tree to find whether the customer will repay the loan or not .

### Training & Testing the model

In [13]:
x = df.drop('Result',axis=1)
y = df['Result']

In [14]:
x_train,x_test,y_train,y_test = train_test_split(x,y,test_size=0.2,random_state=20)

In [15]:
dtclass = DecisionTreeClassifier()

In [16]:
dtclass.fit(x_train,y_train)

DecisionTreeClassifier()

In [17]:
y_pred = dtclass.predict(x_test)

In [18]:
db = pd.DataFrame({"Actual :":y_test,"Predicted :":y_pred})
db

    Actual : Predicted :
890       No          No
694       No          No
798       No          No
147      yes         yes
858       No          No
..       ...         ...
150      yes         yes
279      yes         yes
544       No          No
568       No          No
911       No          No

[200 rows x 2 columns]

In [19]:
from sklearn.metrics import confusion_matrix

In [20]:
confusion_matrix(y_test,y_pred)

array([[97,  8],
       [ 6, 89]], dtype=int64)

In [21]:
accuracy_score(y_test,y_pred)

0.93

# So our model is 93% accurate